advanced/backend/controllers/ConfigController.php

    public function actionModel(){
		if(isset($_GET['id'])){
			$id=intval($_GET['id']);
			$info=WkWitkeyModel::findOne($id);
			if($info['model_status']==1){
				WkWitkeyModel::updateAll(['model_status'=>0],['model_id'=>$id]);
			}else{
				WkWitkeyModel::updateAll(['model_status'=>1],['model_id'=>$id]);
			}
		}
		$res=WkWitkeyModel::find()->where(['model_type'=>'task'])->orderby('model_id')->all();
---
SELECT * FROM `wk_witkey_model` WHERE `model_type`='task' ORDER BY `model_id`