advanced/backend/controllers/ModelController.php

SELECT COUNT(*) FROM `wk_witkey_task` WHERE model_id=3
SELECT * FROM `wk_witkey_task` WHERE model_id=3 LIMIT 10
---
    public function actionJijian_task_list(){
        if(!empty($_GET['search_id'])||!empty($_GET['search_title'])){
       $ord='asc';
       $id=$_GET['search_id'];
       $title=$_GET['search_title'];
       $where='';
       $where="model_id=3";
       if(!empty($_GET['search_id'])){
       $where.=" and task_id = ".$id."";
       }
        if(!empty($_GET['search_title'])){
       $where.=" and task_title like '%".$title."%'";
        }
       $page_size=isset($_GET['pagesize'])?$_GET['pagesize']:10;
       $data = WkWitkeyTask::find()->where($where);
       }else{
           $page_size=isset($_GET['pagesize'])?$_GET['pagesize']:10;
           $where='';
           $where.='model_id=3';
           $ord=isset($_GET['ord'])?$_GET['ord']:'asc';
            if(!empty($_GET['ord'])){
                $where.=" order by task_id ".$_GET['ord']."";
            }
            $data = WkWitkeyTask::find()->where($where);
       }
       $total=$data->count();
       $pages = new Pagination(['totalCount' =>$total, 'pageSize' => $page_size]);
       $list = $data->offset($pages->offset)->limit($pages->limit)->all();

SELECT * FROM `wk_witkey_task` WHERE model_id=5 LIMIT 10 OFFSET 10
SELECT COUNT(*) FROM `wk_witkey_task` WHERE model_id=5
---
    public function actionDeposit_task_list(){
        if(!empty($_GET['search_id'])||!empty($_GET['search_title'])){
       $ord='asc';
       $id=$_GET['search_id'];
       $title=$_GET['search_title'];
       $where='';
       $where="model_id=5";
       if(!empty($_GET['search_id'])){
       $where.=" and task_id = ".$id."";
       }
        if(!empty($_GET['search_title'])){
       $where.=" and task_title like '%".$title."%'";
        }
       $page_size=isset($_GET['pagesize'])?$_GET['pagesize']:10;
       $data = WkWitkeyTask::find()->where($where);
       }else{
           $page_size=isset($_GET['pagesize'])?$_GET['pagesize']:10;
           $where='';
           $where.='model_id=5';
           $ord=isset($_GET['ord'])?$_GET['ord']:'asc';
            if(!empty($_GET['ord'])){
                $where.=" order by task_id ".$_GET['ord']."";
            }
            $data = WkWitkeyTask::find()->where($where);
       }
       $total=$data->count();
       $pages = new Pagination(['totalCount' =>$total, 'pageSize' =>$page_size ]);
       $list = $data->offset($pages->offset)->limit($pages->limit)->all();

SELECT * FROM `wk_witkey_task` WHERE `task_id`='10'
---
    public function actionUp_deposittask(){
       $task_id=$_GET['id'];
        $list=WkWitkeyTask::findOne($task_id);