advanced/backend/controllers/ToolController.php

SELECT * FROM `wk_witkey_ad`
SELECT COUNT(*) FROM `wk_witkey_ad`
SELECT * FROM `wk_witkey_ad` LIMIT 10
---
    public function actionAd_list(){
        $this->layout='@app/views/layouts/publics.php';
        $model=new \yii\db\Query;
        $list=  $model->from("wk_witkey_ad")->all();
        $pages = new Pagination(['totalCount'=>$model->count(),'pageSize'=>10]);
        $list=$model->offset($pages->offset)->limit($pages->limit)->all();