advanced/backend/controllers/UserController.php

SELECT * FROM `wk_witkey_space`, `wk_witkey_member_group` WHERE wk_witkey_space.group_id=wk_witkey_member_group.group_id ORDER BY `uid` DESC
---
    public function actionUser_list(){
        //print_r($_POST);
        if(empty($_POST)){
        $model=new \yii\db\Query();
        $rows = $model->from(['wk_witkey_space','wk_witkey_member_group'])->orderBy("uid desc")->where("wk_witkey_space.group_id=wk_witkey_member_group.group_id")->all();