advanced/backend/controllers/UserController.php

    public function actionUser_list(){
        $this->layout='@app/views/layouts/publics.php';

        //print_r($_GET);
        @$ords=$_GET['ords'];
        @$orda=$_GET['orda'];
        if(empty($_POST)){
        $model=new \yii\db\Query();
        $rows = $model->from(['wk_witkey_space','wk_witkey_member_group'])
                                ->orderBy("$ords $orda")
                                ->where("wk_witkey_space.group_id=wk_witkey_member_group.group_id")
                                ->all();
---
SELECT * FROM `wk_witkey_space`, `wk_witkey_member_group` WHERE wk_witkey_space.group_id=wk_witkey_member_group.group_id

     public function actionCustom_list(){
       if(empty($_POST)){
        $model=new \yii\db\Query();
        $rows = $model->from(['wk_witkey_space','wk_witkey_member_group'])->orderBy("uid desc")->where("wk_witkey_space.group_id=wk_witkey_member_group.group_id and wk_witkey_member_group.group_id=1")->all();
---
SELECT * FROM `wk_witkey_space`, `wk_witkey_member_group` WHERE wk_witkey_space.group_id=wk_witkey_member_group.group_id and wk_witkey_member_group.group_id=1 ORDER BY `uid` DESC

   public function actionGet_user_info(){
       //print_r($_POST);
       $id=$_GET['guid'];
       $model=new \yii\db\Query();
        $rows = $model->from(['wk_witkey_space','wk_witkey_member_group'])->orderBy("uid desc")->where("wk_witkey_space.group_id=wk_witkey_member_group.group_id and wk_witkey_space.uid=$id")->all();
---
SELECT * FROM `wk_witkey_space`, `wk_witkey_member_group` WHERE wk_witkey_space.group_id=wk_witkey_member_group.group_id and wk_witkey_space.uid=4 ORDER BY `uid` DESC