advanced/frontend/views/article/article_list.php

SELECT `nav_title`, `nav_url` FROM `wk_witkey_nav`
---
        	<div class="menu grid_24 clearfix">
                <ul class="clearfix">
     <?php
        $nav= (new \yii\db\Query())
                ->select('nav_title, nav_url')
                ->from('wk_witkey_nav')
                ->all();