advanced/frontend/views/task/upload_mode.php

        	<div class="menu grid_24 clearfix">
                <ul class="clearfix">
     <?php
     $nav= (new \yii\db\Query())
                ->select('nav_title, nav_url')
                ->from('wk_witkey_nav')
                ->all();
---
SELECT `nav_title`, `nav_url` FROM `wk_witkey_nav`