advanced/frontend/controllers/ArticleController.php

SELECT * FROM `wk_witkey_article`, `wk_witkey_article_category` WHERE wk_witkey_article.art_cat_id=wk_witkey_article_category.art_cat_id ORDER BY `is_recommend` DESC
SELECT COUNT(*) FROM `wk_witkey_article`, `wk_witkey_article_category` WHERE wk_witkey_article.art_cat_id=wk_witkey_article_category.art_cat_id ORDER BY `is_recommend` DESC
SELECT * FROM `wk_witkey_article`, `wk_witkey_article_category` WHERE wk_witkey_article.art_cat_id=wk_witkey_article_category.art_cat_id ORDER BY `is_recommend` DESC LIMIT 3 OFFSET 42
---
    public function actionArticle_list(){
        $model=new \yii\db\Query();
        $res = $model->from(['wk_witkey_article','wk_witkey_article_category'])
                             ->orderBy("is_recommend desc")
                             ->where("wk_witkey_article.art_cat_id=wk_witkey_article_category.art_cat_id")
                             ->all();
        $pages = new Pagination(['totalCount'=>$model->count(),'pageSize'=>3]);
        $res=$model->offset($pages->offset)->limit($pages->limit)->all();

SELECT * FROM `wk_witkey_article`, `wk_witkey_article_category` WHERE wk_witkey_article.art_cat_id=wk_witkey_article_category.art_cat_id and wk_witkey_article.art_id='224'
---
   public function actionArticle_info(){

       $art_id=$_GET["art_id"];
       $model=new \yii\db\Query();
       $res = $model->from(['wk_witkey_article','wk_witkey_article_category'])
                             ->where("wk_witkey_article.art_cat_id=wk_witkey_article_category.art_cat_id and wk_witkey_article.art_id='".$art_id."'")
                             ->one();