advanced/frontend/controllers/SquareController.php

INSERT INTO `wk_witkey_service` (`username`, `uid`, `title`, `content`, `price`, `service_type`, `on_time`) VALUES ('admin', 1, 's', 'ssssssss', '0', 0, 1419596381)
SELECT * FROM `wk_witkey_service`
SELECT COUNT(*) FROM `wk_witkey_service`
SELECT * FROM `wk_witkey_service` WHERE 1=1 order by service_id desc LIMIT 5
SELECT * FROM `wk_witkey_order` WHERE `order_name`='s'
SELECT * FROM `wk_witkey_space` WHERE `uid`='1'
---
   public function actionSquare_add(){
        $session=new \yii\web\Session();
        $xuqiu=$_GET['xuqiu'];
        $txt_title=$_GET['txt_title'];
        $tar_content=$_GET['tar_content'];
        if($xuqiu=="免费服务"){
            $service = new WkWitkeyService();
            $service->username=$session->get("user_name");
            $service->uid=$session->get("u_id");
            $service->title=$txt_title;
            $service->content=$tar_content;
            $service->price='0';
            $service->service_type ="0";
            $service->on_time=time();
            $a=$service->insert();
            if($a){
        $model=new Query();
         $data = $model->from(['wk_witkey_service'])->all();
        $pages = new Pagination(['totalCount'=>$model->count(),'pageSize'=>5]);
        $data=$model->offset($pages->offset)->limit($pages->limit)->where("1=1 order by service_id desc")->all();
        foreach(@$data as $key=>$val){
        @$arr=WkWitkeyOrder::find()->where(['order_name' => $val['title']])->one();
        if($arr['order_username']){
            $data[$key]['order_username']=$arr['order_username'];
        }
         @$arr=WkWitkeySpace::find()->where(['uid' => $val['uid']])->one();