advanced/frontend/controllers/TaskController.php

            $session->set("sj",$min."-".$max);
        }
        $model=new Query();
        $data1 = $model->from(['wk_witkey_task','wk_witkey_model'])->where("wk_witkey_task.model_id=wk_witkey_model.model_id and $where order by end_time desc")->all();
        //print_r($_GET);//die;
        $total=$model->count();
---
SELECT * FROM `wk_witkey_model` WHERE `model_id`='1'
SELECT * FROM `wk_witkey_task`, `wk_witkey_model` WHERE wk_witkey_task.model_id=wk_witkey_model.model_id and 1=1 order by end_time desc
SELECT COUNT(*) FROM `wk_witkey_task`, `wk_witkey_model` WHERE wk_witkey_task.model_id=wk_witkey_model.model_id and 1=1 order by end_time desc